[
    {
        "0": {
            "id": 17,
            "title": "Chaqueta impermeable para mujer, cortavientos, impermeables de escalada a rayas",
            "price": 39.99,
            "description": "Ligero, perfecto para viajes o uso informal. Manga larga con capucha, diseño de cintura con cordón ajustable. Chubasquero con cierre frontal con botón y cremallera, totalmente forrado a rayas. El chubasquero tiene 2 bolsillos laterales y es de buen tamaño para guardar todo tipo de cosas, cubre las caderas y la capucha es generosa pero no exagerada. Capucha forrada de algodón adjunta con Los cordones ajustables le dan un aspecto de estilo real.",
            "category": "Ropa de mujer",
            "image": "https://fakestoreapi.com/img/71HblAHs5xL._AC_UY879_-2.jpg",
            "rating": {
                "rate": 3.8,
                "count": 679
            },
            "count": 2
        },
        "1": {
            "id": 5,
            "title": "John Hardy Pulsera de cadena con estación de dragón dorado y plateado Legends Naga para mujer",
            "price": 695,
            "description": "De nuestra colección Legends, el Naga se inspiró en el mítico dragón de agua que protege la perla del océano. Úselo mirando hacia adentro para recibir amor y abundancia, o hacia afuera para protección.",
            "category": "Joyería",
            "image": "https://fakestoreapi.com/img/71pWzhdJNwL._AC_UL640_QL65_ML3_.jpg",
            "rating": {
                "rate": 4.6,
                "count": 400
            },
            "count": 1
        },
        "idCompra": "xd0vkpkq8"
    },
    {
        "0": {
            "id": 1,
            "title": "Fjallraven - Mochila Foldsack No. 1, con capacidad para 15 portátiles",
            "price": 109.95,
            "description": "Tu mochila perfecta para el uso diario y los paseos por el bosque. Guarde su computadora portátil (hasta 15 pulgadas) en la funda acolchada, su uso diario",
            "category": "Ropa de Hombre",
            "image": "https://fakestoreapi.com/img/81fPKd-2AYL._AC_SL1500_.jpg",
            "rating": {
                "rate": 3.9,
                "count": 120
            },
            "count": 1
        },
        "1": {
            "id": 8,
            "title": "Búho perforado de acero inoxidable chapado en oro rosa doble",
            "price": 10.99,
            "description": "Pendientes tipo túnel acampanados dobles chapados en oro rosa. Hecho de acero inoxidable 316L",
            "category": "Joyería",
            "image": "https://fakestoreapi.com/img/51UDEzMJVpL._AC_UL640_QL65_ML3_.jpg",
            "rating": {
                "rate": 1.9,
                "count": 100
            },
            "count": 2
        },
        "idCompra": "kodf4qpds"
    },
    {
        "0": {
            "id": 8,
            "title": "Búho perforado de acero inoxidable chapado en oro rosa doble",
            "price": 10.99,
            "description": "Pendientes tipo túnel acampanados dobles chapados en oro rosa. Hecho de acero inoxidable 316L",
            "category": "Joyería",
            "image": "https://fakestoreapi.com/img/51UDEzMJVpL._AC_UL640_QL65_ML3_.jpg",
            "rating": {
                "rate": 1.9,
                "count": 100
            },
            "count": 10
        },
        "idCompra": "pw7g7a06b"
    },
    {
        "0": {
            "id": 14,
            "title": "Monitor de juegos curvo Samsung CHG90 de 49 pulgadas y 144 Hz (LC49HG90DMNXZA) – Pantalla súper ultraancha QLED",
            "price": 999.99,
            "description": "MONITOR PARA JUEGOS CURVO 32:9 SÚPER ULTRAANCHO DE 49 PULGADAS con pantalla dual de 27 pulgadas una al lado de la otra TECNOLOGÍA QUANTUM DOT (QLED), compatibilidad con HDR y calibración de fábrica que proporciona colores y contraste increíblemente realistas y precisos ALTA FRECUENCIA DE ACTUALIZACIÓN de 144 HZ y tiempo de respuesta ultrarrápido de 1 ms para trabajar elimine el desenfoque de movimiento, las imágenes fantasma y reduzca el retraso de entrada",
            "category": "Electrónica",
            "image": "https://fakestoreapi.com/img/81Zt42ioCgL._AC_SX679_.jpg",
            "rating": {
                "rate": 2.2,
                "count": 140
            },
            "count": 3
        },
        "1": {
            "id": 12,
            "title": "La unidad para juegos WD de 4 TB funciona con el disco duro externo portátil Playstation 4",
            "price": 114,
            "description": "Amplíe su experiencia de juego en PS4, juegue en cualquier lugar Configuración rápida y sencilla Diseño elegante con alta capacidad, garantía limitada del fabricante de 3 años",
            "category": "Electrónica",
            "image": "https://fakestoreapi.com/img/61mtL65D4cL._AC_SX679_.jpg",
            "rating": {
                "rate": 4.8,
                "count": 400
            },
            "count": 5
        },
        "idCompra": "nl2i0bwao"
    }
]